Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public LinkedFileStatus GetLinkedFileStatus()
  Visual Basic
Public Function GetLinkedFileStatus As LinkedFileStatus
  Visual C++
public:
LinkedFileStatus GetLinkedFileStatus()
 Remarks
 Options are Invalid, Loaded, Unloaded, NotFound, or Imported.
 See Also
  ExternalFileReference Class
  Autodesk.Revit.DB Namespace